УТ_для_edt/src/Documents/смартASP_БонусыЗаРемонтныеРаботы/смартASP_БонусыЗаРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартASP_БонусыЗаРемонтныеРаботы</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <registerRecords>AccumulationRegister.смартASP_НакоплениеБонусов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднийКурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОборота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусРасчетаБонусов</name>
    <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
    <type>
      <types>EnumRef.смартСтатусыДокументовРасчетаБонусов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачислениеБонусов</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Представительство</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГарантийныхРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлатныхРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаГарантийныеРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаПлатныеРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеНачисленияБонуса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартASP_БонусныйФонд/смартASP_БонусныйФонд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартASP_БонусныйФонд</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>EnumRef.смартASP_Константы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартASP_ЗаменыПодразделений/смартASP_ЗаменыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартASP_ЗаменыПодразделений</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <resources>
    <name>ЗаменяющееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ПодразделениеДляЗамены</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыДокументовРасчетаБонусов/смартСтатусыДокументовРасчетаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыДокументовРасчетаБонусов</name>
  <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗавершен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартASP_Константы/смартASP_Константы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартASP_Константы</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <enumValues>
    <name>ПроцентОборотаБонусныйФонд</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОборотаБФСЦ</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВидыГарантии/смартВидыГарантии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыГарантии</name>
  <comment>//смарт:ММ #082 397 28.02.2021</comment>
  <enumValues>
    <name>Гарантия</name>
  </enumValues>
  <enumValues>
    <name>Платная</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартСтатусыЗаявокНаРемонтныеРаботы/смартСтатусыЗаявокНаРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыЗаявокНаРемонтныеРаботы</name>
  <comment>//смарт:ММ #082 397 11.11.2020</comment>
  <enumValues>
    <name>НоваяЗаявка</name>
  </enumValues>
  <enumValues>
    <name>ПолученаВРаботу</name>
  </enumValues>
  <enumValues>
    <name>ДиагностикаПроведена</name>
    <comment>//++ #Б-4814 смарт: Фролов 23.10.2025 //Добавление нового статуса в заявку на ремонтные работы.</comment>
  </enumValues>
  <enumValues>
    <name>СозвонилисьСКлиентом</name>
  </enumValues>
  <enumValues>
    <name>ОтправленаВПредставительство</name>
  </enumValues>
  <enumValues>
    <name>НазначенИнженер</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПовторныйВыезд</name>
  </enumValues>
  <enumValues>
    <name>РемонтЗавершен</name>
  </enumValues>
  <enumValues>
    <name>ПовторныйВыезд</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаАннулирована</name>
    <comment>// смарт:ММ 18.05.2021</comment>
  </enumValues>
  <enumValues>
    <name>РемонтОсуществленПоТелефону</name>
    <comment>// смарт:ММ 18.05.2021</comment>
  </enumValues>
  <enumValues>
    <name>ОшибочнаяЗаявка</name>
    <comment>// смарт:ММ 13.08.2021</comment>
  </enumValues>
  <enumValues>
    <name>ЖдемЗапчасти</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартASP_БонусыЗаРемонтныеРаботы/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	Если НЕ ЗначениеЗаполнено(Объект.смартСтатусРасчетаБонусов) Тогда
		Объект.смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	УстановитьДоступностьПоСтатусуРасчета();
	//--#1288 смарт: Лопато 26.12.2022
	
КонецПроцедуры

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура УстановитьДоступностьПоСтатусуРасчета()

	смартASP_ОбщийМодуль.смартУстановитьТолькоПросмотрФормыРасчетЗавершен(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьДоступностьПоСтатусуРасчета();

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти

#Область ОбработчикиКомандФормы
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ЗаполнитьНаСервере_() //первое заполнение запросом. работает некорректно
	//НачислениеБонусовТЗ = Объект.НачислениеБонусов.Выгрузить();
	//НачислениеБонусовТЗ.Сортировать("Инженер ВОЗР");
	
	//Для Каждого Стр Из НачислениеБонусовТЗ Цикл
	//	Если НЕ ЗначениеЗаполнено(Стр.Инженер) Тогда
	//		НачислениеБонусовТЗ.Удалить(Стр);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ОписаниеНачисления = НачислениеБонусовТЗ.ВыгрузитьКолонку("ОписаниеНачисленияБонуса");
	//
	//КоличествоСтрокТЧ = НачислениеБонусовТЗ.Количество();
	//НачислениеБонусовТЗ.Свернуть("Инженер");
	//КоличествоСтрокТЧСверка = НачислениеБонусовТЗ.Количество();
	//
	//Если КоличествоСтрокТЧ <> КоличествоСтрокТЧСверка Тогда
	//	Сообщить("Имеются строки с одинаковым полем ""Инженер""!");
	//	Возврат;
	//КонецЕсли;
	//
	//Инженеры = НачислениеБонусовТЗ.ВыгрузитьКолонку("Инженер");
	
	СтруктураДанныхПоОбороту = смартASP_ОбщийМодуль.ASP_ПолучитьДанныеОборотаПоРемонтнымРаботам(Объект.Дата,, Объект.СреднийКурсВалюты);
	Если Не СтруктураДанныхПоОбороту=Неопределено Тогда
		Если СтруктураДанныхПоОбороту.Выручка = Null  Тогда
			Сообщить("Нет данных по обороту!");
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ASP_БонусныйФондСрезПоследних.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.смартASP_БонусныйФонд.СрезПоследних(&Дат, ) КАК ASP_БонусныйФондСрезПоследних
		|ГДЕ
		|	ASP_БонусныйФондСрезПоследних.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Категория",Перечисления.смартASP_Константы.ПроцентОборотаБонусныйФонд);
	Запрос.УстановитьПараметр("Дат",КонецМесяца(Объект.Дата));
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоэффициентКатегории = Выборка.Коэффициент;
	Иначе
		КоэффициентКатегории = 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"
	// Выручка по подразделениям
	|ВЫБРАТЬ
	|	ВыручкаПоПодразделениям.Подразделение КАК Подразделение,
	|	ВыручкаПоПодразделениям.Выручка КАК Выручка
	|ПОМЕСТИТЬ ВТ_ВыручкаПоПодразделениям_тз
	|ИЗ
	|	&ВыручкаПоПодразделениямТЗ КАК ВыручкаПоПодразделениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВТ_ВыручкаПоПодразделениям.Подразделение) КАК Подразделение,
	|	СУММА(ВТ_ВыручкаПоПодразделениям.Выручка) КАК Выручка
	|ПОМЕСТИТЬ ВТ_ВыручкаПоПодразделениям
	|ИЗ
	|	ВТ_ВыручкаПоПодразделениям_тз КАК ВТ_ВыручкаПоПодразделениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ЗаменыПодразделений КАК смартASP_ЗаменыПодразделений
	|		ПО ВТ_ВыручкаПоПодразделениям.Подразделение = смартASP_ЗаменыПодразделений.ПодразделениеДляЗамены
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВТ_ВыручкаПоПодразделениям.Подразделение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаРемонтныеРаботы.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаРемонтныеРаботы.ВидГарантии = ЗНАЧЕНИЕ(Перечисление.смартВидыГарантии.Платная)
	|			ТОГДА ""Платный""
	|		КОГДА смартЗаявкаНаРемонтныеРаботы.ВидГарантии = ЗНАЧЕНИЕ(Перечисление.смартВидыГарантии.Гарантия)
	|			ТОГДА ""Гарантия""
	|	КОНЕЦ КАК ВидРабот,
	|	смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер КАК Инженер,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС
	|		ИНАЧЕ смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо
	|	КОНЕЦ КАК ДатаОкончанияРабот,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаРемонтныеРаботы.Представительство = &ПустоеПодразделение
	|			ТОГДА &ГоловнойОфисМосква
	|		ИНАЧЕ смартЗаявкаНаРемонтныеРаботы.Представительство
	|	КОНЕЦ КАК Представительство
	|ПОМЕСТИТЬ ВТ_Заявки_вр
	|ИЗ
	|	Документ.смартЗаявкаНаРемонтныеРаботы КАК смартЗаявкаНаРемонтныеРаботы
	|ГДЕ
	|	НЕ смартЗаявкаНаРемонтныеРаботы.ПометкаУдаления
	|	И смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И смартЗаявкаНаРемонтныеРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен)
	|	И (смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|				И смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|			ИЛИ смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|				И смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	смартЗаявкаНаРемонтныеРаботы.Ссылка,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаРемонтныеРаботы.ВидГарантии = ЗНАЧЕНИЕ(Перечисление.смартВидыГарантии.Платная)
	|			ТОГДА ""Платный""
	|		КОГДА смартЗаявкаНаРемонтныеРаботы.ВидГарантии = ЗНАЧЕНИЕ(Перечисление.смартВидыГарантии.Гарантия)
	|			ТОГДА ""Гарантия""
	|	КОНЕЦ,
	|	смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо2 = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС2
	|		ИНАЧЕ смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаРемонтныеРаботы.Представительство = &ПустоеПодразделение
	|			ТОГДА &ГоловнойОфисМосква
	|		ИНАЧЕ смартЗаявкаНаРемонтныеРаботы.Представительство
	|	КОНЕЦ
	|ИЗ
	|	Документ.смартЗаявкаНаРемонтныеРаботы КАК смартЗаявкаНаРемонтныеРаботы
	|ГДЕ
	|	НЕ смартЗаявкаНаРемонтныеРаботы.ПометкаУдаления
	|	И смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер2 <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И смартЗаявкаНаРемонтныеРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен)
	|	И (смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо2 >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|				И смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо2 <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|			ИЛИ смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС2 >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|				И смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС2 <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заявки.Ссылка КАК Ссылка,
	|	ВТ_Заявки.ВидРабот КАК ВидРабот,
	|	ВТ_Заявки.Инженер КАК Инженер,
	|	ВТ_Заявки.ДатаОкончанияРабот КАК ДатаОкончанияРабот,
	|	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВТ_Заявки.Представительство) КАК Представительство
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	ВТ_Заявки_вр КАК ВТ_Заявки
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ЗаменыПодразделений КАК смартASP_ЗаменыПодразделений
	|		ПО ВТ_Заявки.Представительство = смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Заявки.Ссылка) КАК КоличествоОбщее,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Заявки.ВидРабот = ""Гарантия""
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоГарантия,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Заявки.ВидРабот = ""Платный""
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПлатная
	|ПОМЕСТИТЬ ВТ_КоличествоЗаявокПоВидамГарантии
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|ГДЕ
	|	ВТ_Заявки.ДатаОкончанияРабот >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ВТ_Заявки.ДатаОкончанияРабот <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&БонусныйФонд / ВТ_КоличествоЗаявокПоВидамГарантии.КоличествоОбщее * ВТ_КоличествоЗаявокПоВидамГарантии.КоличествоГарантия КАК БонусныйФондГарантия,
	|	&БонусныйФонд - &БонусныйФонд / ВТ_КоличествоЗаявокПоВидамГарантии.КоличествоОбщее * ВТ_КоличествоЗаявокПоВидамГарантии.КоличествоГарантия КАК БонусныйФондПлатная
	|ПОМЕСТИТЬ ВТ_БонусныйФондРаспределенный
	|ИЗ
	|	ВТ_КоличествоЗаявокПоВидамГарантии КАК ВТ_КоличествоЗаявокПоВидамГарантии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыручкаПоПодразделениям.Подразделение КАК Подразделение,
	|	ВТ_ВыручкаПоПодразделениям.Выручка / &ВыручкаОбщая * ВТ_БонусныйФондРаспределенный.БонусныйФондПлатная КАК Выручка
	|ПОМЕСТИТЬ ВТ_СуммыПоПодразделениям
	|ИЗ
	|	ВТ_ВыручкаПоПодразделениям КАК ВТ_ВыручкаПоПодразделениям,
	|	ВТ_БонусныйФондРаспределенный КАК ВТ_БонусныйФондРаспределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заявки.Представительство КАК Представительство,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_СуммыПоПодразделениям.Выручка, 0)) / КОЛИЧЕСТВО(ВТ_Заявки.Ссылка) КАК Цена
	|ПОМЕСТИТЬ ВТ_СтоимостьПлатнойЗаявкиПредставительства
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыПоПодразделениям КА0К ВТ_СуммыПоПодразделениям
	|		ПО ВТ_Заявки.Представительство = ВТ_СуммыПоПодразделениям.Подразделение
	|ГДЕ
	|	ВТ_Заявки.ДатаОкончанияРабот >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ВТ_Заявки.ДатаОкончанияРабот <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ВТ_Заявки.Представительство <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	И ВТ_Заявки.ВидРабот = ""Платный""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заявки.Представительство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заявки.Инженер КАК Инженер,
	|	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВТ_Заявки.Инженер.Подразделение) КАК Подразделение,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Заявки.ВидРабот = ""Гарантия""
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Гарантия,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Заявки.ВидРабот = ""Платный""
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Платная
	|ПОМЕСТИТЬ ВТ_ИнженерыСКоличествомЗаявок
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ЗаменыПодразделений КАК смартASP_ЗаменыПодразделений
	|		ПО ВТ_Заявки.Инженер.Подразделение = смартASP_ЗаменыПодразделений.ПодразделениеДляЗамены
	|ГДЕ
	|	ВТ_Заявки.ДатаОкончанияРабот >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ВТ_Заявки.ДатаОкончанияРабот <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заявки.Инженер,
	|	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВТ_Заявки.Инженер.Подразделение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнженерыСКоличествомЗаявок.Инженер КАК Инженер,
	|	ВТ_ИнженерыСКоличествомЗаявок.Подразделение КАК Представительство,
	|	ВТ_ИнженерыСКоличествомЗаявок.Гарантия КАК КоличествоГарантийныхРабот,
	|	ВТ_ИнженерыСКоличествомЗаявок.Платная КАК КоличествоПлатныхРабот,
	|	ВТ_ИнженерыСКоличествомЗаявок.Платная * ЕСТЬNULL(ВТ_СтоимостьПлатнойЗаявкиПредставительства.Цена, 0) КАК СуммаЗаПлатныеРаботы,
	|	ВТ_ИнженерыСКоличествомЗаявок.Гарантия * (&БонусныйФонд / ЕСТЬNULL(ВТ_КоличествоЗаявокПоВидамГарантии.КоличествоОбщее, 0)) КАК СуммаЗаГарантийныеРаботы,
	|	ВТ_ИнженерыСКоличествомЗаявок.Гарантия * (&БонусныйФонд / ЕСТЬNULL(ВТ_КоличествоЗаявокПоВидамГарантии.КоличествоОбщее, 0)) + ВТ_ИнженерыСКоличествомЗаявок.Платная * ЕСТЬNULL(ВТ_СтоимостьПлатнойЗаявкиПредставительства.Цена, 0) КАК СуммаКВыплате
	|ИЗ
	|	ВТ_ИнженерыСКоличествомЗаявок КАК ВТ_ИнженерыСКоличествомЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьПлатнойЗаявкиПредставительства КАК ВТ_СтоимостьПлатнойЗаявкиПредставительства
	|		ПО ВТ_ИнженерыСКоличествомЗаявок.Подразделение = ВТ_СтоимостьПлатнойЗаявкиПредставительства.Представительство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоЗаявокПоВидамГарантии КАК ВТ_КоличествоЗаявокПоВидамГарантии
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ИнженерыСКоличествомЗаявок.Инженер.Наименование";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ВыручкаОбщая", СтруктураДанныхПоОбороту.Выручка);
	
	//Оборот СЦ (с учетом отборов) / 100 * 1,5 * средний курс ЦБ (в рабочие дни месяца) = бонусный фонд за все акты (ОбщийФонд). 
	Запрос.УстановитьПараметр("БонусныйФонд", СтруктураДанныхПоОбороту.Выручка * КоэффициентКатегории/100);
	
	Запрос.УстановитьПараметр("ВыручкаПоПодразделениямТЗ", СтруктураДанныхПоОбороту.ВыручкаПоПодразделениямТЗ);
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	Запрос.УстановитьПараметр("ГоловнойОфисМосква", Константы.смартASP_ПодразделениеДляЗаменыПустогоВЗаявках.Получить());
	//Запрос.УстановитьПараметр("Инженеры", Инженеры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатЗапросаТЗ = РезультатЗапроса.Выгрузить();
	РезультатЗапросаТЗ.Колонки.Добавить("ОписаниеНачисленияБонуса");
	РезультатЗапросаТЗ.Колонки.Добавить("КоличествоГарантийныхРаботСохр");
	РезультатЗапросаТЗ.Колонки.Добавить("КоличествоПлатныхРаботСохр");
	
	
	//РезультатЗапросаТЗ.ЗагрузитьКолонку(ОписаниеНачисления, "ОписаниеНачисленияБонуса");
	РезультатЗапросаТЗ.ЗагрузитьКолонку(РезультатЗапросаТЗ.ВыгрузитьКолонку("КоличествоГарантийныхРабот"), "КоличествоГарантийныхРаботСохр");
	РезультатЗапросаТЗ.ЗагрузитьКолонку(РезультатЗапросаТЗ.ВыгрузитьКолонку("КоличествоПлатныхРабот"), "КоличествоПлатныхРаботСохр");
	
	Объект.НачислениеБонусов.Загрузить(РезультатЗапросаТЗ);
    Объект.СуммаОборота=СтруктураДанныхПоОбороту.Выручка;	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.НачислениеБонусов.Очистить();
	
	СтруктураДанныхПоОбороту = смартASP_ОбщийМодуль.ASP_ПолучитьДанныеОборотаПоРемонтнымРаботам(Объект.Дата,, Объект.СреднийКурсВалюты);
	Если Не СтруктураДанныхПоОбороту=Неопределено Тогда
		Если СтруктураДанныхПоОбороту.Выручка = Null ИЛИ СтруктураДанныхПоОбороту.Выручка = 0 Тогда
			Сообщить("Нет данных по обороту!");
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ASP_БонусныйФондСрезПоследних.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.смартASP_БонусныйФонд.СрезПоследних(&Дат, ) КАК ASP_БонусныйФондСрезПоследних
		|ГДЕ
		|	ASP_БонусныйФондСрезПоследних.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Категория",Перечисления.смартASP_Константы.ПроцентОборотаБонусныйФонд);
	Запрос.УстановитьПараметр("Дат",КонецМесяца(Объект.Дата));
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоэффициентКатегории = Выборка.Коэффициент;
	Иначе
		Сообщить("Не заполнен коэффициент по категории!");
		Возврат;
	КонецЕсли;
	
	////////////////////////////////
	//Оборот СЦ (с учетом отборов) / 100 * 1,5 * средний курс ЦБ (в рабочие дни месяца) = бонусный фонд за все акты (ОбщийФонд).
	
	ОбщийФонд = СтруктураДанныхПоОбороту.Выручка / 100 * КоэффициентКатегории;
	
	//++ #1331 смарт: Фролов 24.03.2023 //Добавить в расчет бонусов бесплатные услуги  
	ИтогоБесплатные=0;
	ОбщийФондБесплатныеЗаявки=0;
	ЗапросБеспллатные=Новый Запрос("ВЫБРАТЬ
	                               |	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВЫБОР
	                               |			КОГДА смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка.Представительство = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	                               |				ТОГДА &ГоловнойОфисМосква
	                               |			ИНАЧЕ смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка.Представительство
	                               |		КОНЕЦ) КАК Подразделение,
	                               |	СУММА(смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Сумма) КАК Сумма
	                               |ИЗ
	                               |	Документ.смартЗаявкаНаРемонтныеРаботы.БесплатныеУслуги КАК смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ЗаменыПодразделений КАК смартASP_ЗаменыПодразделений
	                               |		ПО смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка.Представительство = смартASP_ЗаменыПодразделений.ПодразделениеДляЗамены
	                               |ГДЕ
	                               |	НЕ смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка.ПометкаУдаления
	                               |	И смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка.НазначеннаяДатаРемонтаПо МЕЖДУ &ДатаНачала И &ДатаОкончения
	                               |
	                               |СГРУППИРОВАТЬ ПО
	                               |	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВЫБОР
	                               |			КОГДА смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка.Представительство = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	                               |				ТОГДА &ГоловнойОфисМосква
	                               |			ИНАЧЕ смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка.Представительство
	                               |		КОНЕЦ)
	                               |;
	                               |
	                               |////////////////////////////////////////////////////////////////////////////////
	                               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка КАК Ссылка
	                               |ПОМЕСТИТЬ ТабЗаказы
	                               |ИЗ
	                               |	Документ.смартЗаявкаНаРемонтныеРаботы.БесплатныеУслуги КАК смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги
	                               |ГДЕ
	                               |	смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка.НазначеннаяДатаРемонтаПо МЕЖДУ &ДатаНачала И &ДатаОкончения
	                               |	И НЕ смартЗаявкаНаРемонтныеРаботыБесплатныеУслуги.Ссылка.ПометкаУдаления
	                               |;
	                               |
	                               |////////////////////////////////////////////////////////////////////////////////
	                               |ВЫБРАТЬ
	                               |	ТабЗаказы.Ссылка КАК Ссылка,
	                               |	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВЫБОР
	                               |			КОГДА ТабЗаказы.Ссылка.Представительство = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	                               |				ТОГДА &ГоловнойОфисМосква
	                               |			ИНАЧЕ ТабЗаказы.Ссылка.Представительство
	                               |		КОНЕЦ) КАК Представительство,
	                               |	ТабЗаказы.Ссылка.НазначенныйНаРемонтИнженер КАК Инженер,
	                               |	ВЫБОР
	                               |		КОГДА ТабЗаказы.Ссылка.НазначенныйНаРемонтИнженер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                               |				И ТабЗаказы.Ссылка.НазначенныйНаРемонтИнженер2 <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                               |			ТОГДА 0.5
	                               |		ИНАЧЕ 1
	                               |	КОНЕЦ КАК Кол,
	                               |	ТабЗаказы.Ссылка.НазначеннаяДатаРемонтаПо КАК НазначеннаяДатаРемонта
	                               |ПОМЕСТИТЬ ТабИнженеры
	                               |ИЗ
	                               |	ТабЗаказы КАК ТабЗаказы
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ЗаменыПодразделений КАК смартASP_ЗаменыПодразделений
	                               |		ПО ТабЗаказы.Ссылка.Представительство = смартASP_ЗаменыПодразделений.ПодразделениеДляЗамены
	                               |ГДЕ
	                               |	ТабЗаказы.Ссылка.НазначенныйНаРемонтИнженер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	ТабЗаказы.Ссылка,
	                               |	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВЫБОР
	                               |			КОГДА ТабЗаказы.Ссылка.Представительство = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	                               |				ТОГДА &ГоловнойОфисМосква
	                               |			ИНАЧЕ ТабЗаказы.Ссылка.Представительство
	                               |		КОНЕЦ),
	                               |	ТабЗаказы.Ссылка.НазначенныйНаРемонтИнженер2,
	                               |	ВЫБОР
	                               |		КОГДА ТабЗаказы.Ссылка.НазначенныйНаРемонтИнженер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                               |				И ТабЗаказы.Ссылка.НазначенныйНаРемонтИнженер2 <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                               |			ТОГДА 0.5
	                               |		ИНАЧЕ 1
	                               |	КОНЕЦ,
	                               |	ТабЗаказы.Ссылка.НазначеннаяДатаРемонтаПо
	                               |ИЗ
	                               |	ТабЗаказы КАК ТабЗаказы
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ЗаменыПодразделений КАК смартASP_ЗаменыПодразделений
	                               |		ПО ТабЗаказы.Ссылка.Представительство = смартASP_ЗаменыПодразделений.ПодразделениеДляЗамены
	                               |ГДЕ
	                               |	ТабЗаказы.Ссылка.НазначенныйНаРемонтИнженер2 <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                               |;
	                               |
	                               |////////////////////////////////////////////////////////////////////////////////
	                               |ВЫБРАТЬ
	                               |	ТабИнженеры.Ссылка КАК Ссылка,
	                               |	ТабИнженеры.Инженер КАК Инженер,
	                               |	СУММА(ТабИнженеры.Кол) КАК Кол,
	                               |	ТабИнженеры.НазначеннаяДатаРемонта КАК ДатаОкончанияРабот,
	                               |	ТабИнженеры.Представительство КАК Представительство
	                               |ИЗ
	                               |	ТабИнженеры КАК ТабИнженеры
	                               |
	                               |СГРУППИРОВАТЬ ПО
	                               |	ТабИнженеры.Ссылка,
	                               |	ТабИнженеры.Инженер,
	                               |	ТабИнженеры.НазначеннаяДатаРемонта,
	                               |	ТабИнженеры.Представительство");
	ЗапросБеспллатные.УстановитьПараметр("ГоловнойОфисМосква", Константы.смартASP_ПодразделениеДляЗаменыПустогоВЗаявках.Получить());
	ЗапросБеспллатные.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Дата));
	ЗапросБеспллатные.УстановитьПараметр("ДатаОкончения", КонецМесяца(Объект.Дата)); 
	МасРезБесплатные=ЗапросБеспллатные.ВыполнитьПакет();
	РезБесплатные=МасРезБесплатные[0].Выгрузить();
	тзЗаявокБесплатные=МасРезБесплатные[3].Выгрузить();
	Если РезБесплатные.Количество()>0 Тогда
		ИтогоБесплатные=РезБесплатные.Итог("Сумма");
		ОбщийФондБесплатныеЗаявки=ИтогоБесплатные/ 100*КоэффициентКатегории;
	КонецЕсли;	
	
	//-- #1331 смарт: Фролов 24.03.2023
	
	////////////////////////////////
	//Общее количество гарантийных заявок + общее количество платных заявок = ОбщееКоличествоЗаявок.
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	смартЗаявкаНаРемонтныеРаботы.Ссылка КАК Ссылка,
	               |	смартЗаявкаНаРемонтныеРаботы.ВидГарантии КАК ВидРабот,
	               |	смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер КАК Инженер,
	               |	ВЫБОР
	               |		КОГДА смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС
	               |		ИНАЧЕ смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо
	               |	КОНЕЦ КАК ДатаОкончанияРабот,
	               |	ВЫБОР
	               |		КОГДА смартЗаявкаНаРемонтныеРаботы.Представительство = &ПустоеПодразделение
	               |			ТОГДА &ГоловнойОфисМосква
	               |		ИНАЧЕ смартЗаявкаНаРемонтныеРаботы.Представительство
	               |	КОНЕЦ КАК Представительство,
	               |	ВЫБОР
	               |		КОГДА смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |				И смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер2 <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ТОГДА 0.5
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Кол
	               |ПОМЕСТИТЬ ВТ_Заявки_вр
	               |ИЗ
	               |	Документ.смартЗаявкаНаРемонтныеРаботы КАК смартЗаявкаНаРемонтныеРаботы
	               |ГДЕ
	               |	НЕ смартЗаявкаНаРемонтныеРаботы.ПометкаУдаления
	               |	И смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |	И смартЗаявкаНаРемонтныеРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен)
	               |	И (смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	               |				И смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	               |			ИЛИ смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	               |				И смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	смартЗаявкаНаРемонтныеРаботы.Ссылка,
	               |	смартЗаявкаНаРемонтныеРаботы.ВидГарантии,
	               |	смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер2,
	               |	ВЫБОР
	               |		КОГДА смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо2 = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС2
	               |		ИНАЧЕ смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо2
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА смартЗаявкаНаРемонтныеРаботы.Представительство = &ПустоеПодразделение
	               |			ТОГДА &ГоловнойОфисМосква
	               |		ИНАЧЕ смартЗаявкаНаРемонтныеРаботы.Представительство
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |				И смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер2 <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ТОГДА 0.5
	               |		ИНАЧЕ 1
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.смартЗаявкаНаРемонтныеРаботы КАК смартЗаявкаНаРемонтныеРаботы
	               |ГДЕ
	               |	НЕ смартЗаявкаНаРемонтныеРаботы.ПометкаУдаления
	               |	И смартЗаявкаНаРемонтныеРаботы.НазначенныйНаРемонтИнженер2 <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |	И смартЗаявкаНаРемонтныеРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен)
	               |	И (смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо2 >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	               |				И смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаПо2 <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	               |			ИЛИ смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС2 >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	               |				И смартЗаявкаНаРемонтныеРаботы.НазначеннаяДатаРемонтаС2 <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Заявки.Ссылка КАК Ссылка,
	               |	ВТ_Заявки.ВидРабот КАК ВидРабот,
	               |	ВТ_Заявки.Инженер КАК Инженер,
	               |	ВТ_Заявки.ДатаОкончанияРабот КАК ДатаОкончанияРабот,
	               |	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, ВТ_Заявки.Представительство) КАК Представительство,
	               |	ВТ_Заявки.Кол КАК Кол
	               |ИЗ
	               |	ВТ_Заявки_вр КАК ВТ_Заявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ЗаменыПодразделений КАК смартASP_ЗаменыПодразделений
	               |		ПО ВТ_Заявки.Представительство = смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение
	               |ГДЕ
	               |	ВТ_Заявки.ДатаОкончанияРабот >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	               |	И ВТ_Заявки.ДатаОкончанияРабот <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)";
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	Запрос.УстановитьПараметр("ГоловнойОфисМосква", Константы.смартASP_ПодразделениеДляЗаменыПустогоВЗаявках.Получить());
	
	тзЗаявок = Запрос.Выполнить().Выгрузить(); 
	//++ #1331 смарт: Фролов 24.03.2023 //Добавить в расчет бонусов бесплатные услуги
	Для Каждого Стр Из тзЗаявокБесплатные Цикл
		СтрокитзЗаявок=тзЗаявок.НайтиСтроки(Новый Структура("Ссылка",Стр.Ссылка));	
		Если СтрокитзЗаявок.Количество()=0 Тогда
			СтртзЗаявок=тзЗаявок.Добавить();		
			СтртзЗаявок.ссылка=Стр.Ссылка;
			СтртзЗаявок.ВидРабот=Перечисления.смартВидыГарантии.Платная;
			СтртзЗаявок.Инженер=Стр.Инженер;
			СтртзЗаявок.ДатаОкончанияРабот=Стр.ДатаОкончанияРабот;
			СтртзЗаявок.Представительство=Стр.Представительство;
			СтртзЗаявок.Кол=Стр.Кол;
		КонецЕсли;	
	КонецЦикла;	
	//-- #1331 смарт: Фролов 24.03.2023	
	тзЗаявок.Индексы.Добавить("ВидРабот, Представительство");
	
	ОбщееКоличествоЗаявок = тзЗаявок.Итог("Кол");
	
	
	////////////////////////////////
	//ОбщийФонд / ОбщееКоличествоЗаявок = Бонус за 1 гарантийную заявку (БонусГарантийнаяЗаявка). Гарантийная заявка для всех представительств стоит одинаково. 
	
	БонусГарантийнаяЗаявка = ОбщийФонд / ОбщееКоличествоЗаявок;
	
	
    ////////////////////////////////
	//БонусГарантийнаяЗаявка * Общее количество гарантийных заявок = ОбщийФондГарантийныеЗаявки
	
	Отбор = Новый Структура("ВидРабот", Перечисления.смартВидыГарантии.Гарантия);
	тзГарантийныхЗаявок = тзЗаявок.Скопировать(Отбор);
	
	КоличествоГарантийныхЗаявок = тзГарантийныхЗаявок.Итог("Кол");
	ОбщийФондГарантийныеЗаявки = БонусГарантийнаяЗаявка * КоличествоГарантийныхЗаявок; 

	
	////////////////////////////////
	//ОбщийФонд - ОбщийФондГарантийныеЗаявки = ОбщийФондПлатныеЗаявки
	
	ОбщийФондПлатныеЗаявки = ОбщийФонд - ОбщийФондГарантийныеЗаявки;
	
	
	////////////////////////////////
	//Оборот СЦ по платным услугам (ОборотПлатныеУслуги) = ОборотПлатныеУслугиПредставительство1 + ОборотПлатныеУслугиПредставительство2 + ОборотПлатныеУслугиПредставительство3
	//ОбщийФондПлатныеЗаявки делится между представительствами по пропорции:
	//БонусПлатныеЗаявкиПредставительство1 = ОборотПлатныеУслугиПредставительство1 / ОборотПлатныеУслуги
	//БонусПлатныеЗаявкиПредставительство2 = ОборотПлатныеУслугиПредставительство2 / ОборотПлатныеУслуги
	//БонусПлатныеЗаявкиПредставительство3 = ОборотПлатныеУслугиПредставительство3 / ОборотПлатныеУслуги
	//БонусПлатныеЗаявкиПредставительство1 / Количество платных заявок представительства 1 = Стоимость 1 платной заявки для инженеров представительства 1. 
	//БонусПлатныеЗаявкиПредставительство2 / Количество платных заявок представительства 2 = Стоимость 1 платной заявки для инженеров представительства 2.
	//БонусПлатныеЗаявкиПредставительство3 / Количество платных заявок представительства 3 = Стоимость 1 платной заявки для инженеров представительства 3.
	
	СтруктураДанныхПоОборотуПлатные = смартASP_ОбщийМодуль.ASP_ПолучитьДанныеОборотаПоРемонтнымРаботам(Объект.Дата,, Объект.СреднийКурсВалюты, ИСТИНА);
	
	тзВыручкаПоПодразделениям = СтруктураДанныхПоОборотуПлатные.ВыручкаПоПодразделениямТЗ;
	//++ #1331 смарт: Фролов 24.03.2023 //Добавить в расчет бонусов бесплатные услуги
	//тзВыручкаПоПодразделениям.Колонки.Добавить("Доля");
	//тзВыручкаПоПодразделениям.Колонки.Добавить("Бонус");
	//тзВыручкаПоПодразделениям.Колонки.Добавить("СтоимостьОднойПлатнойЗаявки"); 
	тзВыручкаПоПодразделениям.Колонки.Добавить("Доля",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
	тзВыручкаПоПодразделениям.Колонки.Добавить("Бонус",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
	тзВыручкаПоПодразделениям.Колонки.Добавить("СтоимостьОднойПлатнойЗаявки",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
	тзВыручкаПоПодразделениям.Колонки.Добавить("ДоляБесплатные",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));  
	тзВыручкаПоПодразделениям.Колонки.Добавить("ВыручкаБесплатные",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой))); 
	тзВыручкаПоПодразделениям.Колонки.Добавить("БонусБесплатные",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
	Для Каждого СтрБесплатные Из РезБесплатные Цикл
		СтрокитзВыручкаПоПодразделениям=тзВыручкаПоПодразделениям.НайтиСтроки(Новый Структура("Подразделение",СтрБесплатные.Подразделение));			
		Если СтрокитзВыручкаПоПодразделениям.Количество()=0 Тогда
			СтртзВыручкаПоПодразделениям=тзВыручкаПоПодразделениям.Добавить();		
			СтртзВыручкаПоПодразделениям.Подразделение=СтрБесплатные.Подразделение; 
			СтртзВыручкаПоПодразделениям.ВыручкаБесплатные=СтрБесплатные.Сумма; 
			СтртзВыручкаПоПодразделениям.Выручка=0;
		Иначе
			СтрокитзВыручкаПоПодразделениям[0].ВыручкаБесплатные=СтрБесплатные.Сумма;
		КонецЕсли;	
	КонецЦикла;
	//-- #1331 смарт: Фролов 24.03.2023
		
	Для Каждого стр Из тзВыручкаПоПодразделениям Цикл
		стр.Доля = стр.Выручка / СтруктураДанныхПоОборотуПлатные.Выручка;
		стр.Бонус = ОбщийФондПлатныеЗаявки * стр.Доля;
		
		//++ #1331 смарт: Фролов 24.03.2023 //Добавить в расчет бонусов бесплатные услуги 
		Если ИтогоБесплатные>0 Тогда
			стр.ДоляБесплатные = стр.ВыручкаБесплатные / ИтогоБесплатные;
			стр.БонусБесплатные = ОбщийФондБесплатныеЗаявки * стр.ДоляБесплатные;
		Иначе
			стр.ДоляБесплатные =0;
			стр.БонусБесплатные=0;
		КонецЕсли;
		
		стр.Бонус=стр.Бонус+стр.БонусБесплатные;
		//-- #1331 смарт: Фролов 24.03.2023
		
		Отбор = Новый Структура("ВидРабот, Представительство", Перечисления.смартВидыГарантии.Платная, стр.Подразделение);
		КолПлатЗаявокПодр = тзЗаявок.Скопировать(Отбор).Итог("Кол");
		
		Если КолПлатЗаявокПодр = 0 Тогда
			стр.СтоимостьОднойПлатнойЗаявки = 0
		Иначе
			стр.СтоимостьОднойПлатнойЗаявки = стр.Бонус / КолПлатЗаявокПодр
		КонецЕсли;
		
	КонецЦикла;
	тзВыручкаПоПодразделениям.Индексы.Добавить("Подразделение");
    
	////////////////////////////////
	//Итог:
	//БонусИнженерПредставительство1 = количество гарантийных заявок этого инженера * БонусГарантийнаяЗаявка + количество платных заявок этого инженера * Стоимость 1 платной заявки инженеров представительства 1.
	//БонусИнженерПредставительство2 = количество гарантийных заявок этого инженера * БонусГарантийнаяЗаявка + количество платных заявок этого инженера * Стоимость 1 платной заявки инженеров представительства 2.
	//БонусИнженерПредставительство3 = количество гарантийных заявок этого инженера * БонусГарантийнаяЗаявка + количество платных заявок этого инженера * Стоимость 1 платной заявки инженеров представительства 3.
	
	тзИнженеры = тзЗаявок.Скопировать(, "ВидРабот, Представительство, Инженер, Кол");
	тзИнженеры.Свернуть("ВидРабот, Представительство, Инженер", "Кол");
	тзИнженеры.Сортировать("Инженер");
	
	Отбор = Новый Структура("Инженер, Представительство");
	ОтборПодр = Новый Структура("Подразделение");
	
	Для Каждого стр Из тзИнженеры Цикл
		
		Отбор.Инженер = стр.Инженер;
		Отбор.Представительство = стр.Представительство;
		МасСтрок = Объект.НачислениеБонусов.НайтиСтроки(Отбор);
		
		Если МасСтрок.Количество() = 0 Тогда
			нов = Объект.НачислениеБонусов.Добавить();
			нов.Инженер = стр.Инженер;
			нов.Представительство = стр.Представительство;
		Иначе
			нов = МасСтрок[0]
		КонецЕсли;
		
		Если стр.ВидРабот = Перечисления.смартВидыГарантии.Гарантия Тогда
			нов.КоличествоГарантийныхРабот = стр.Кол;
			нов.СуммаЗаГарантийныеРаботы = нов.КоличествоГарантийныхРабот * БонусГарантийнаяЗаявка
		Иначе
			нов.КоличествоПлатныхРабот = стр.Кол;
			
			стрТЗ = тзВыручкаПоПодразделениям.Найти(стр.Представительство, "Подразделение");
			Если стрТЗ <> Неопределено Тогда			
				нов.СуммаЗаПлатныеРаботы = нов.КоличествоПлатныхРабот  * стрТЗ.СтоимостьОднойПлатнойЗаявки
			КонецЕсли;
		КонецЕсли;
		
		нов.СуммаКВыплате = нов.СуммаЗаГарантийныеРаботы + нов.СуммаЗаПлатныеРаботы;
	КонецЦикла;
	
	/////////////////////////////////////////////////////
	Объект.СуммаОборота=СтруктураДанныхПоОбороту.Выручка;
	
	//++#1288 смарт: Лопато 29.12.2022 //Дополннение в блоке расчета бонусов инженеров
	Сообщить("Таблица перезаполнена!");
	Модифицированность = Истина
	//--#1288 смарт: Лопато 29.12.2022
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура Заполнить(Команда)
	ОчиститьСообщения();
	ЗаполнитьНаСервере();
КонецПроцедуры

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачислениеБонусов
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура НачислениеБонусовКоличествоГарантийныхРаботПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НачислениеБонусов.ТекущиеДанные;
	
	Если ТекущиеДанные.КоличествоГарантийныхРаботСохр = 0 Тогда
		ТекущиеДанные.СуммаЗаГарантийныеРаботы = ТекущиеДанные.КоличествоГарантийныхРабот * ТекущиеДанные.СуммаЗаГарантийныеРаботы;
	Иначе
		ТекущиеДанные.СуммаЗаГарантийныеРаботы = ТекущиеДанные.КоличествоГарантийныхРабот * (ТекущиеДанные.СуммаЗаГарантийныеРаботы / ТекущиеДанные.КоличествоГарантийныхРаботСохр);
	КонецЕсли;
	
	ТекущиеДанные.СуммаКВыплате = ТекущиеДанные.СуммаЗаГарантийныеРаботы + ТекущиеДанные.СуммаЗаПлатныеРаботы;
	ТекущиеДанные.КоличествоГарантийныхРаботСохр = ТекущиеДанные.КоличествоГарантийныхРабот;
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура НачислениеБонусовКоличествоПлатныхРаботПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НачислениеБонусов.ТекущиеДанные;
	
	Если ТекущиеДанные.КоличествоПлатныхРаботСохр = 0 Тогда
		ТекущиеДанные.СуммаЗаПлатныеРаботы = ТекущиеДанные.КоличествоПлатныхРабот * ТекущиеДанные.СуммаЗаПлатныеРаботы;
	Иначе
		ТекущиеДанные.СуммаЗаПлатныеРаботы = ТекущиеДанные.КоличествоПлатныхРабот * (ТекущиеДанные.СуммаЗаПлатныеРаботы / ТекущиеДанные.КоличествоПлатныхРаботСохр);
	КонецЕсли;
	
	ТекущиеДанные.СуммаЗаПлатныеРаботы = ТекущиеДанные.КоличествоПлатныхРабот * (ТекущиеДанные.СуммаЗаПлатныеРаботы / ТекущиеДанные.КоличествоПлатныхРаботСохр);
	ТекущиеДанные.СуммаКВыплате = ТекущиеДанные.СуммаЗаГарантийныеРаботы + ТекущиеДанные.СуммаЗаПлатныеРаботы;
	ТекущиеДанные.КоличествоПлатныхРаботСохр = ТекущиеДанные.КоличествоПлатныхРабот;
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого Стр Из Объект.НачислениеБонусов Цикл
		Стр.КоличествоГарантийныхРаботСохр = Стр.КоличествоГарантийныхРабот;
		Стр.КоличествоПлатныхРаботСохр = Стр.КоличествоПлатныхРабот;
	КонецЦикла;
	
	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//--#1288 смарт: Лопато 26.12.2022

КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Номер = ""
КонецПроцедуры
#КонецОбласти

#Область ПодключаемыеКоманды

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти
